grevaillot/svd_tools/headers/STM32H7x7_CM7/gpioe.h
/** @defgroup gpioe_gpio_bsrr GPIOBSRR GPIO port bit set/reset register
@{*/

/** GPIOE_GPIO_BSRR_BR15 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR15		(1 << 31)
/** GPIOE_GPIO_BSRR_BR14 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR14		(1 << 30)
/** GPIOE_GPIO_BSRR_BR13 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR13		(1 << 29)
/** GPIOE_GPIO_BSRR_BR12 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR12		(1 << 28)
/** GPIOE_GPIO_BSRR_BR11 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR11		(1 << 27)
/** GPIOE_GPIO_BSRR_BR10 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR10		(1 << 26)
/** GPIOE_GPIO_BSRR_BR9 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR9		(1 << 25)
/** GPIOE_GPIO_BSRR_BR8 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR8		(1 << 24)
/** GPIOE_GPIO_BSRR_BR7 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR7		(1 << 23)
/** GPIOE_GPIO_BSRR_BR6 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR6		(1 << 22)
/** GPIOE_GPIO_BSRR_BR5 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR5		(1 << 21)
/** GPIOE_GPIO_BSRR_BR4 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR4		(1 << 20)
/** GPIOE_GPIO_BSRR_BR3 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR3		(1 << 19)
/** GPIOE_GPIO_BSRR_BR2 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR2		(1 << 18)
/** GPIOE_GPIO_BSRR_BR1 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR1		(1 << 17)
/** GPIOE_GPIO_BSRR_BR0 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOE_GPIO_BSRR_BR0		(1 << 16)
/** GPIOE_GPIO_BSRR_BS15 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS15		(1 << 15)
/** GPIOE_GPIO_BSRR_BS14 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS14		(1 << 14)
/** GPIOE_GPIO_BSRR_BS13 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS13		(1 << 13)
/** GPIOE_GPIO_BSRR_BS12 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS12		(1 << 12)
/** GPIOE_GPIO_BSRR_BS11 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS11		(1 << 11)
/** GPIOE_GPIO_BSRR_BS10 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS10		(1 << 10)
/** GPIOE_GPIO_BSRR_BS9 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS9		(1 << 9)
/** GPIOE_GPIO_BSRR_BS8 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS8		(1 << 8)
/** GPIOE_GPIO_BSRR_BS7 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS7		(1 << 7)
/** GPIOE_GPIO_BSRR_BS6 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS6		(1 << 6)
/** GPIOE_GPIO_BSRR_BS5 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS5		(1 << 5)
/** GPIOE_GPIO_BSRR_BS4 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS4		(1 << 4)
/** GPIOE_GPIO_BSRR_BS3 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS3		(1 << 3)
/** GPIOE_GPIO_BSRR_BS2 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS2		(1 << 2)
/** GPIOE_GPIO_BSRR_BS1 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS1		(1 << 1)
/** GPIOE_GPIO_BSRR_BS0 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOE_GPIO_BSRR_BS0		(1 << 0)

/**@}*/

/** @defgroup gpioe_gpio_lckr GPIOLCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers).
@{*/

/** GPIOE_GPIO_LCKR_LCKK Lock key This bit can be read any time. It can only be modified using the lock key write sequence. LOCK key write sequence: WR LCKR[16] = 1 + LCKR[15:0] WR LCKR[16] = 0 + LCKR[15:0] WR LCKR[16] = 1 + LCKR[15:0] RD LCKR RD LCKR[16] = 1 (this read operation is optional but it confirms that the lock is active) Note: During the LOCK key write sequence, the value of LCK[15:0] must not change. Any error in the lock sequence aborts the lock. After the first lock sequence on any bit of the port, any read access on the LCKK bit will return 1 until the next MCU reset or peripheral reset. **/
#define GPIOE_GPIO_LCKR_LCKK		(1 << 16)
/** GPIOE_GPIO_LCKR_LCK15 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK15		(1 << 15)
/** GPIOE_GPIO_LCKR_LCK14 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK14		(1 << 14)
/** GPIOE_GPIO_LCKR_LCK13 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK13		(1 << 13)
/** GPIOE_GPIO_LCKR_LCK12 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK12		(1 << 12)
/** GPIOE_GPIO_LCKR_LCK11 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK11		(1 << 11)
/** GPIOE_GPIO_LCKR_LCK10 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK10		(1 << 10)
/** GPIOE_GPIO_LCKR_LCK9 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK9		(1 << 9)
/** GPIOE_GPIO_LCKR_LCK8 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK8		(1 << 8)
/** GPIOE_GPIO_LCKR_LCK7 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK7		(1 << 7)
/** GPIOE_GPIO_LCKR_LCK6 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK6		(1 << 6)
/** GPIOE_GPIO_LCKR_LCK5 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK5		(1 << 5)
/** GPIOE_GPIO_LCKR_LCK4 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK4		(1 << 4)
/** GPIOE_GPIO_LCKR_LCK3 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK3		(1 << 3)
/** GPIOE_GPIO_LCKR_LCK2 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK2		(1 << 2)
/** GPIOE_GPIO_LCKR_LCK1 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK1		(1 << 1)
/** GPIOE_GPIO_LCKR_LCK0 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOE_GPIO_LCKR_LCK0		(1 << 0)

/**@}*/

