grevaillot/svd_tools/headers/STM32H7x7_CM7/gpioe.h
/** @defgroup gpioe_gpio_afrl GPIOAFRL GPIO alternate function low register
@{*/


#define GPIOE_GPIO_AFRL_AFSEL7_SHIFT		28
#define GPIOE_GPIO_AFRL_AFSEL7_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel7 AFSEL7 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOE_GPIO_AFRL_AFSEL6_SHIFT		24
#define GPIOE_GPIO_AFRL_AFSEL6_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel6 AFSEL6 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOE_GPIO_AFRL_AFSEL5_SHIFT		20
#define GPIOE_GPIO_AFRL_AFSEL5_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel5 AFSEL5 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOE_GPIO_AFRL_AFSEL4_SHIFT		16
#define GPIOE_GPIO_AFRL_AFSEL4_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel4 AFSEL4 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOE_GPIO_AFRL_AFSEL3_SHIFT		12
#define GPIOE_GPIO_AFRL_AFSEL3_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel3 AFSEL3 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOE_GPIO_AFRL_AFSEL2_SHIFT		8
#define GPIOE_GPIO_AFRL_AFSEL2_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel2 AFSEL2 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOE_GPIO_AFRL_AFSEL1_SHIFT		4
#define GPIOE_GPIO_AFRL_AFSEL1_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel1 AFSEL1 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOE_GPIO_AFRL_AFSEL0_SHIFT		0
#define GPIOE_GPIO_AFRL_AFSEL0_MASK		0x0f
/** @defgroup gpioe_gpio_afrl_afsel0 AFSEL0 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioe_gpio_afrh GPIOAFRH GPIO alternate function high register
@{*/


#define GPIOE_GPIO_AFRH_AFSEL15_SHIFT		28
#define GPIOE_GPIO_AFRH_AFSEL15_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel15 AFSEL15 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOE_GPIO_AFRH_AFSEL14_SHIFT		24
#define GPIOE_GPIO_AFRH_AFSEL14_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel14 AFSEL14 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOE_GPIO_AFRH_AFSEL13_SHIFT		20
#define GPIOE_GPIO_AFRH_AFSEL13_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel13 AFSEL13 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOE_GPIO_AFRH_AFSEL12_SHIFT		16
#define GPIOE_GPIO_AFRH_AFSEL12_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel12 AFSEL12 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOE_GPIO_AFRH_AFSEL11_SHIFT		12
#define GPIOE_GPIO_AFRH_AFSEL11_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel11 AFSEL11 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOE_GPIO_AFRH_AFSEL10_SHIFT		8
#define GPIOE_GPIO_AFRH_AFSEL10_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel10 AFSEL10 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOE_GPIO_AFRH_AFSEL9_SHIFT		4
#define GPIOE_GPIO_AFRH_AFSEL9_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel9 AFSEL9 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOE_GPIO_AFRH_AFSEL8_SHIFT		0
#define GPIOE_GPIO_AFRH_AFSEL8_MASK		0x0f
/** @defgroup gpioe_gpio_afrh_afsel8 AFSEL8 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


/**@}*/
